sdaiReindexArray(Sdai_Id_aggr*)
\details
Reindexes the elements of a specified array.
\param sdaiArray [in] An array to be reindexed.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiVA_NSET - Value not set.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.